---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricParamLocationSlab
source: html/f197831f-a033-5d62-94f1-cffdeb21547f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricParamLocationSlab Property

"Location": Fabric location in the slab

## Syntax (C#)
```csharp
public static ForgeTypeId FabricParamLocationSlab { get; }
```